// data/bestSellingProducts.ts
export interface Product {
  id: string;
  name: string;
  slug: string;
  image: string;
  description?: string;
  category?: string[];
  brand?: string;
  keywords?: string[];
}

export const bestSellingProducts: Product[] = 
[
  {
    "id": "1",
    "name": "เหล็กกัลวาไนซ์ ชลบุรี",
    "slug": "galvanized-steel-chonburi",
    "image": "/images/product/product00001.jpg",
    "description": "เหล็กกัลวาไนช์ไม่ต้องทาสีไม่เป็นสนิม ผลิตจากเหล็กที่ผ่านการชุบเคลือบสังกะสีแบบจุ่มร้อน (Hot-dip Galvanizing) ช่วยป้องกันการเกิดสนิม และการผุกร่อน การนำไปใช้งานทนทาน อายุการใช้งานยาวนาน สามารถใช้งานได้ทันที และหลากหลายขนาดทั้งเหล็กกล่องสี่เหลี่ยมและเหล็กกล่องแบน เพื่อรองรับการใช้งานแต่ละประเภทแตกต่างกันไปเหล็กกล่องชุบกัลวาไนซ์ เหมาะกับงานโครงสร้างทั่วไป เหล็กตัวซีกัลวาไนซ์ เหมาะกับงานทำโครงหลังคาเป็นหลัก, โครงสร้างที่อยู่อาศัย, เสาค้ำยัน, แปหลังคา",
    "category": ["เหล็ก", "ผู้ผลิตและออกแบบโครงสร้างเหล็ก", "วัสดุก่อสร้าง"],
    "brand": "บริษัท ทีเอ็น โลหะกิจ จำกัด",
    "keywords": ["เหล็กกัลวาไนซ์ ชลบุรี"]
  },
  {
    "id": "2",
    "name": "เหล็กเส้นกลม ชลบุรี",
    "slug": "round-bar-chonburi",
    "image": "/images/product/product00002.jpg",
    "description": "เหล็กเส้น มีลักษณะหน้าตัดกลม ผิวเรียบ มีขนาดเส้นผ่าศูนย์กลางตั้งแต่ 6 มิลลิเมตร  ถึงขนาด 15 มิลลิเมตร (RB6 - RB15) แลเหล็กเส้นกลมจะมี ความยาว 10 เมตรต่อเส้นเหล็กกลม นิยมใช้กับงานโครงสร้างขนาดเล็ก งานส่วนที่ไม่รับแรงมากนัก หรือใช้ในการกลึงต่างๆ นิยมใช้ใช้งานทั่วไป งานก่อสร้างเสริมคอนกรีต สะพาน ทำรั้ว ถนน และงานพื้น ผลิตภัณฑ์เหล็กเส้นเสริมคอนกรีต : เหล็กเส้นกลม มอก.20-2559",
    "category": ["เหล็ก", "ผู้ผลิตและออกแบบโครงสร้างเหล็ก", "วัสดุก่อสร้าง"],
    "brand": "บริษัท ทีเอ็น โลหะกิจ จำกัด",
    "keywords": ["เหล็กเส้นกลม ชลบุรี"]
  },
  {
    "id": "3",
    "name": "เหล็กข้ออ้อย ชลบุรี",
    "slug": "deformed-bar-chonburi",
    "image": "/images/product/product00003.jpg",
    "description": "ลักษณะเหล็กเส้นข้ออ้อย เหล็กเส้นกลมจะมีผิวของเหล็กจะมีลักษณะเป็นปล้องเพื่อเพิ่มแรงยึดเหนี่ยวให้เหล็กกับคอนกรีตมากขึ้น สามารถรับแรงได้มากกว่าเหล็กเส้นกลม มีขนาดเส้นผ่าศูนย์กลางตั้งแต่ 10 มิลลิเมตร - 25 มิลลิเมตร (DB10 - DB25) เหล็กข้ออ้อยมีความยาว 10 เมตรต่อเส้น นิยมใช้กับงานโครงสร้าง ที่มีขนาดใหญ่แข็งแรงผลิตภัณฑ์เหล็กเส้นเสริมคอนกรีต เหล็กข้ออ้อย มอก.24-2559",
    "category": ["เหล็ก", "ผู้ผลิตและออกแบบโครงสร้างเหล็ก", "วัสดุก่อสร้าง"],
    "brand": "บริษัท ทีเอ็น โลหะกิจ จำกัด",
    "keywords": ["เหล็กข้ออ้อย ชลบุรี"]
  },
  {
    "id": "4",
    "name": "เหล็กกล่องดำ ชลบุรี",
    "slug": "black-square-tube-chonburi",
    "image": "/images/product/product00004.jpg",
    "description": "เหล็กกล่องเหลี่ยมหรือเหล็กแป๊บ เป็นเหล็กรูปพรรณมีลักษณะสี่เหลี่ยมจัตุรัส กลวง ผิวเรียบ เหมาะกับงานโครงสร้างทั่วไป ใช้แทนไม้หรือคอนกรีตสำหรับโครงสร้างเช่น เสา นั่งร้าน โรงจอดรถ ประตู รั้ว โครงหลังคาเหล็ก คานเหล็ก  หรือลูกค้าสามารถโทรสอบถาม เรื่องเหล็กกล่องดำ ได้ก่อนการสั่งซื้อ หากซื้อมีจำนวน เรามีบริการจัดส่งหน้างาน หน้าร้านได้",
    "category": ["เหล็ก", "ผู้ผลิตและออกแบบโครงสร้างเหล็ก", "วัสดุก่อสร้าง"],
    "brand": "บริษัท ทีเอ็น โลหะกิจ จำกัด",
    "keywords": ["เหล็กกล่องดำ ชลบุรี"]
  },
  {
    "id": "5",
    "name": "เหล็กตัวซี ชลบุรี",
    "slug": "c-channel-steel-chonburi",
    "image": "/images/product/product00005.jpg",
    "description": "เหล็กกล่องเหลี่ยมหรือเหล็กแป๊บ เป็นเหล็กรูปพรรณมีลักษณะสี่เหลี่ยมจัตุรัส กลวง ผิวเรียบ เหมาะกับงานโครงสร้างทั่วไป ใช้แทนไม้หรือคอนกรีตสำหรับโครงสร้างเช่น เสา นั่งร้าน โรงจอดรถ ประตู รั้ว โครงหลังคาเหล็ก คานเหล็ก  หรือลูกค้าสามารถโทรสอบถาม เรื่องเหล็กกล่องดำ ได้ก่อนการสั่งซื้อ หากซื้อมีจำนวน เรามีบริการจัดส่งหน้างาน หน้าร้านได้",
    "category": ["เหล็ก", "ผู้ผลิตและออกแบบโครงสร้างเหล็ก", "วัสดุก่อสร้าง"],
    "brand": "บริษัท ทีเอ็น โลหะกิจ จำกัด",
    "keywords": ["เหล็กตัวซี ชลบุรี"]
  },
  {
    "id": "6",
    "name": "เหล็กบีม ชลบุรี",
    "slug": "beam-steel-chonburi",
    "image": "/images/product/product00006.jpg",
    "description": "เหล็กไอบีม (I-Beams) หรือที่นิยมเรียกกันว่า เหล็กตัวไอ, เสาบีม ลักษณะหน้าตัดรูปตัวไอ (I) ทั้งปีกบนและปีกล่างจะเป็นแผ่นเอียง สามารถรับน้ำหนักที่มาก รองรับแรงกระแทกได้ดี เหมาะสำหรับนำไปใช้ในงานรางเลื่อนของเครนในโรงงานอุตสาหกรรม ที่ไว้ใช้ยกสิ่งของที่มีน้ำหนักมาก, งานเครื่องจักร, ทำเสา, คาน, งานโครงสร้างต่างๆที่ต้องการความแข็งแรง และรองรับน้ำหนักจำนวนมากๆเหล็กเอชบีม (H-Beams) เป็นเหล็กลักษณะหน้าตัดรูปตัวเอช (H) ทั้งปีกบนและล่าง จะเป็นแผ่นเรียบหนา ทำมุมฉากเท่ากันตลอด สามารถที่จะรองรับน้ำหนักและโมเมนต์ได้ดี มีความแข็งแรง เป็นเหล็กเหมาะสำหรับการนำไปใช้ในงานก่อสร้างอาคาร ในส่วนของเสา,คาน,โครงหลังคา,งานก่อสร้างขนาดเล็กเหล็กไวด์แฟรงค์ (Wide Flange) หรือที่นิยมเรียกกันว่า เหล็กปีก, เหล็กเสา, เสาบีม ความกว้างของแผ่นกลางมากกว่าปีกทั้ง 2 เป็นรูปตัวไอ (I) โดยเหล็กไวด์แฟรงค์ จะมีความกว้างของแผ่นตรงกลาง มากกว่าปีกทั้ง 2 ข้าง มีความแข็งแรงมาก เหมาะสำหรับนำไปใช้ในงานก่อสร้างอาคาร ในส่วนของเสา,คาน,โครงหลังคา, งานเชื่อม, ก่อสร้างอาคาร, โรงงานขนาดใหญ่ผลิตภัณฑ์เหล็กโครงสร้างรูปพรรณรีดร้อน : มอก.1227-2558",
    "category": ["เหล็ก", "ผู้ผลิตและออกแบบโครงสร้างเหล็ก", "วัสดุก่อสร้าง"],
    "brand": "บริษัท ทีเอ็น โลหะกิจ จำกัด",
    "keywords": ["เหล็กบีม ชลบุรี"]
  },
  {
    "id": "7",
    "name": "เหล็กฉาก ชลบุรี",
    "slug": "angle-steel-chonburi",
    "image": "/images/product/product00007.jpg",
    "description": "เหล็กฉาก บ้านบึง ลักษณะหน้าตัดเป็นตัวแอล (L) ซึ่งจะมีด้านเท่ากันทั้ง 2 ด้าน ฉากตั้งตรง 90องศา มีความคงทนแข็งแรง มีหลายขนาดเช่น เหล็กฉากขนาดใหญ่จะใช้ทำเสาโครงสร้าง, โครงหลังคา, โครงสร้างโรงงานอุตสาหกรรม, โครงสร้างป้ายขนาดใหญ่, โครงสร้างบันได ส่วนขนาดเล็กนำมาประยุกต์ใช้ได้หลากหลายเช่น เชื่อมชั้นวางของ, โต๊ะเก้าอี้, เจาะรู, งานเชื่อม เป็นต้นเหล็กฉากรู ชลบุรีเหล็กฉากเจาะรู หรือ เหล็กฉากเอนกประสงค์ เหล็กแผ่นรีดร้อนที่ผ่านการเจาะรูรูปวงรี ตลอดแนว แล้วผ่านการขึ้นรูปให้เป็นเหล็กฉาก 90 องศา นิยมใช้หลากหลาย เช่น ชั้นเหล็กฉาก ชั้นวางสินค้า ชั้นวางของ ชั้นเก็บอะไหล่ สต็อกสินค้าผลิตภัณฑ์เหล็กโครงสร้างรูปพรรณรีดร้อน : มอก.1227-2558",
    "category": ["เหล็ก", "ผู้ผลิตและออกแบบโครงสร้างเหล็ก", "วัสดุก่อสร้าง", "เหล็ก"],
    "brand": "บริษัท ทีเอ็น โลหะกิจ จำกัด",
    "keywords": ["เหล็กฉาก ชลบุรี"]
  },
  {
    "id": "8",
    "name": "ตะแกรงเหล็กฉีก ชลบุรี",
    "slug": "expanded-metal-chonburi",
    "image": "/images/product/product00008.jpg",
    "description": "ตะแกรงเหล็กฉีก บ้านบึง ราคาถูก ผลิตจากแผ่นโลหะมาทำการฉีกให้เป็นช่องรูปข้าวหลามตัด โดยแต่ละมุมจะยังคงยึดติดกัน เป็นการเพิ่มความแข็งแรงของโครงสร้างและลดน้ำหนักของแผ่นโลหะ มีความแข็งแรงสูง รับน้ำหนักกดบนแผ่นได้มากโดยไม่บิดงอหรือเสียรูป มีความฝืดบนผิวหน้า น้ำหนักเบา ใช้งานได้ในหลายรูปแบบ เช่น ทำรั้ว, ทำทางเดินเหนือศีรษะ, ใช้ในงานก่อสร้างแทนการผูกเหล็ก, ทำไส้กรอง, ทำแผ่นกั้นช่องระบายอากาศ หรืองานตกแต่งทำฝ้าเพดานสไตล์ลอฟท์เราเป็นร้านค้าส่งเหล็กรายใหญ่ของชลบุรี มีบริการส่งตะแกรงเหล็กฉีกเหล็กกล่อง เหล็กตัวซีเหล็กรูปพรรณเหล็กเส้น เหล็กข้ออ้อยเหล็กบีม หรือเหล็กเกรดพิเศษเราจัดหาให้ได้ TN LOHAKIT พร้อมบริการจัดส่งตะแกรงเหล็กฉีกด่วนในพื้นที่บ้านบึง พานทอง พนัสนิคม ศรีราชา บ่อวินอมตะ หนองใหญ่บางละมุ งบ่อทอง เกาะจันทร์ อำเภอเมืองชลบุรี และจังหวัดใกล้เคียงโทรสอบถาม หรือสั่งตะแกรงเหล็กฉีก : 096-903-9955, 086-820-5230",
    "category": ["เหล็ก", "ผู้ผลิตและออกแบบโครงสร้างเหล็ก", "วัสดุก่อสร้าง", "เหล็ก"],
    "brand": "บริษัท ทีเอ็น โลหะกิจ จำกัด",
    "keywords": ["เหล็กตะแกรง ชลบุรี"]
  },
  {
    "id": "9",
    "name": "แป๊ปประปา ชลบุรี",
    "slug": "galvanized-pipe-chonburi",
    "image": "/images/product/product00009.jpg",
    "description": "แป๊ปประปาท่อทรงกลม สีเทาผิวเรียบ เกิดจากการนำท่อดำไปชุบสังกะสีเพื่อเป็นการป้องการเกิดสนิม โดยแบ่งความหนาเป็น 3 ประเภท คือ คาดแดง , คาดน้ำเงิน (USC), คาดเหลือง (Sammy) เหมาะกับการใช้ในงานที่ต้องการความแข็งแรง นิยมใช้ในงาน ท่อระบายน้ำ ท่อน้ำทิ้ง ท่อลำเลียงสายไฟ ลำเลียงของเหลวน้ำ แป๊ปประปา ท่อ เอพีไอ (API) แป๊ปดำท่อ API เป็นท่อทรงกลม กลวง สีดำผิวเรียบความยาวมาตรฐานอยู่ที่ 6 เมตร เหมาะสำหรับงานระบบ นิยมใช้เช่น งานระบบท่อประปา ท่อลำเลียงก๊าซ ระบบท่อแก๊ส ระบบท่อน้ำเย็นในเครื่องปรับอากาศ บ้านบึง ชลบุรี เราเป็นร้านค้าส่งเหล็กรายใหญ่ของชลบุรี มีบริการส่งแป๊ปประปาเหล็กกล่อง เหล็กตัวซี เหล็กรูปพรรณ เหล็กเส้น เหล็กข้ออ้อย เหล็กบีม หรือเหล็กเกรดพิเศษเราจัดหาให้ได้TN LOHAKIT พร้อมบริการจัดส่งแป๊ปประปาด่วนในพื้นที่บ้านบึง พานทอง พนัสนิคม ศรีราชา บ่อวินอมตะ หนองใหญ่ บางละมุง บ่อทอง เกาะจันทร์ อำเภอเมืองชลบุรี และจังหวัดใกล้เคียงโทรสอบถาม หรือสั่งซื้อแป๊ปประปา : 096-903-9955, 086-820-5230",
    "category": ["เหล็ก", "ผู้ผลิตและออกแบบโครงสร้างเหล็ก", "วัสดุก่อสร้าง", "เหล็ก", "อุปกรณ์ วัสดุและเครื่องใช้ประปา"],
    "brand": "บริษัท ทีเอ็น โลหะกิจ จำกัด",
    "keywords": ["แป๊ปประปา ชลบุรี"]
  },
  {
    "id": "10",
    "name": "ร้านเหล็กชลบุรี",
    "slug": "steel-shop-chonburi",
    "image": "/images/product/product00010.jpg",
    "description": "บริษัท ทีเอ็น โลหะกิจ จำกัด เราเป็นโรงงานผลิตและค้าปลีกส่งเหล็กรายใหญ่ในจังหวัดชลบุรี เหล็กราคาถูก คุณภาพเยี่ยม มีบริการส่งตะแกรงเหล็กฉีก เหล็กกล่อง เหล็กตัวซีเหล็กรูปพรรณเหล็กเส้น เหล็กข้ออ้อยเหล็กบีม หรือเหล็กเกรดพิเศษเราจัดหาให้ได้ TN LOHAKIT พร้อมบริการจัดส่งเหล็กด่วนในพื้นที่บ้านบึง พานทอง พนัสนิคม ศรีราชา บ่อวินอมตะ หนองใหญ่ บางละมุง บ่อทอง เกาะจันทร์ อำเภอเมืองชลบุรี และจังหวัดใกล้เคียงโทรสอบถาม หรือสั่งตะแกรงเหล็กฉีก : 096-903-9955, 086-820-5230",
    "category": ["เหล็ก", "ผู้ผลิตและออกแบบโครงสร้างเหล็ก", "วัสดุก่อสร้าง"],
    "brand": "บริษัท ทีเอ็น โลหะกิจ จำกัด",
    "keywords": ["ร้านเหล็กชลบุรี"]
  },
  {
    "id": "11",
    "name": "หลังคาเหล็กเมทัลชีท ชลบุรี",
    "slug": "metal-sheet-roof-chonburi",
    "image": "/images/product/product00011.jpg",
    "description": "หลังคาเหล็ก (Metal sheet) ขายปลีก - ส่ง ชลบุรี ร้านขายหลังคาเหล็กเมทัลชีท แผ่นหลังคาเหล็กคุณภาพที่ผ่านกระบวนการรีดลอนด้วยเครื่องจักรที่ได้มาตรฐานและทันสมัย ทำให้เกิดหลังคาเหล็กที่มีความแข็งแรง ทนทาน ไม่เป็นสนิม รอยต่อน้อย ลดโอกาสการรั่วซึม อายุการใช้งานยาวนาน น้ำหนักเบา ติดตั้งง่าย สามารถนำไปใช้งานด้านอื่นๆ ได้ เช่น งานหลังคา งานต่อเติม งานผนัง งานรั้ว แผ่นฝ้า แผ่นบานเกล็ด และงานตกแต่งทั้งภายใน-ภายนอกอาคาร เป็นต้น อีกทั้งสามารถออกแบบได้หลากหลาย ทั้งแผ่นตรง แผ่นโค้ง แผ่นครอบข้าง ตามที่ลูกค้าต้องการ ประเภทลอนหลังคา 1. ลอนมาตรฐาน 760 2. ลอนสแนปล๊อค / ลอนซีมเลส 3. ลอนฝ้า 4. ลอนสแปนเดรล 5. ลอนรั้ว 6. หลังคา PU FOAM เข้าดูสินค้าเพิ่มเติม คลิกเลย !!! www.ร้านขายเมทัลชีทชลบุรี.com https://www.metalsheettn.com https://metalsheettn.yellowpages.co.th โทรสอบถาม หรือสั่งซื้อหลังคาเหล็ก เมทัลชีท : 094-889-5664, 086-820-5230, 096-903-9955",
    "category": ["เหล็ก", "ผู้ผลิตและออกแบบโครงสร้างเหล็ก", "วัสดุก่อสร้าง", "เหล็ก", "อุปกรณ์ วัสดุและเครื่องใช้ประปา"],
    "brand": "บริษัท ทีเอ็น โลหะกิจ จำกัด",
    "keywords": ["ร้านขายหลังคาเหล็กเมทัลชีท ชลบุรี"]
  },
  {
    "id": "12",
    "name": "ร้านขายเหล็กปลวกแดง",
    "slug": "steel-shop-pluakdaeng",
    "image": "/images/product/product00012.jpg",
    "description": "ผู้ค้าเหล็กรายใหญ่ของชลบุรี-ระยองเราเหล็กพร้อมส่ง ขายส่งเหล็กชนิดต่างๆ เหล็กสำหรับงานก่อสร้าง เหล็กสำหรับงานช่างเหล็กดัด-ทำประตูรั้ว-ทำโครงหลังคากันสาด ครอบคลุมการใช้งานช่างกลึง ช่างกลโรงงานนำไปแปรรูปเชื่อมประกอบงานโครงสร้างเหล็ก เราเป็นที่หนึ่ง เรื่องเหล็กคุณภาพ เหล็กมาตราฐาน มีบริการเปลี่ยน คืน สินค้าเราเป็นร้านค้าส่งเหล็กรายใหญ่ของชลบุรี(พร้อมส่งในจังหวัดใกล้เคียง) มีบริการส่งเหล็กกัลวาไนซ์ เหล็กกล่อง เหล็กตัวซี เหล็กรูปพรรณ เหล็กเส้น เหล็กข้ออ้อย เหล็กบีม หรือเหล็กเกรดพิเศษเราจัดหาให้ได้ โทรสอบถาม หรือสั่งซื้อเหล็กเรามีพร้อมส่ง : 096-903-9955, 086-820-5230",
    "category": ["เหล็ก", "ผู้ผลิตและออกแบบโครงสร้างเหล็ก", "วัสดุก่อสร้าง"],
    "brand": "บริษัท ทีเอ็น โลหะกิจ จำกัด",
    "keywords": ["ร้านขายเหล็กปลวกแดง"]
  },
  {
    "id": "13",
    "name": "ร้านขายเหล็กนิคมพัฒนา",
    "slug": "steel-shop-nikhompattana",
    "image": "/images/product/product00013.jpg",
    "description": "ร้านขายเหล็กกล่องดำนิคมพัฒนา ขายเหล็กกล่องชุบกัลวาไนซ์ เหล็กตัวซีชุบกัลวาไนซ์ เหล็กรูปพรรณรีดเย็น ขายเหล็กเส้นกลม/เหล็กข้ออ้อย สำหรับงานหล่อคอนกรีตและงานช่าง ขายเหล็กบีม SS400 / SM520 เเละเหล็กรูปพรรณรีดร้อน มีบริการเก็บเงินปลายทาง&โอนเข้าบัญชี ออกใบกำกับภาษีได้ สินค้ามีปัญหาสั่งผิดหรือสั่งเกิน เปลี่ยนได้คืนได้ จัดส่งฟรี ตรงเวลา รับสั่งจองเหล็กสเปคพิเศษ-ไซส์พิเศษ โทรสอบถาม หรือสั่งซื้อเหล็กเรามีพร้อมส่ง : 096-903-9955, 086-820-5230",
    "category": ["เหล็ก", "ผู้ผลิตและออกแบบโครงสร้างเหล็ก", "วัสดุก่อสร้าง"],
    "brand": "บริษัท ทีเอ็น โลหะกิจ จำกัด",
    "keywords": ["ร้านขายเหล็กนิคมพัฒนา"]
  },
  {
    "id": "14",
    "name": "ร้านขายเหล็กบ่อวิน",
    "slug": "steel-shop-bowin",
    "image": "/images/product/product00014.jpg",
    "description": "ร้านขายเหล็กบ่อวิน ขายเหล็กก่อสร้าง เหล็กรูปพรรณรีดเย็น ขายเหล็กเส้นกลม/เหล็กข้ออ้อย สำหรับงานผู้รับเหมาที่ต้องการใช้เหล็กจำนวนมากติดต่อเราได้เลยมีราคาพิเศษให้มีบริการเก็บเงินปลายทาง หากได้รับสินค้าแล้วมีปัญหาสั่งผิดหรือสั่งเกิน เปลี่ยนได้คืนได้จัดส่งฟรี ตรงเวลา รับสั่งจองเหล็กสเปคพิเศษ-ไซส์พิเศษ โทรสอบถาม หรือสั่งซื้อเหล็กเรามีพร้อมส่ง : 096-903-9955, 086-820-5230",
    "category": ["เหล็ก", "ผู้ผลิตและออกแบบโครงสร้างเหล็ก", "วัสดุก่อสร้าง"],
    "brand": "บริษัท ทีเอ็น โลหะกิจ จำกัด",
    "keywords": ["ร้านขายเหล็กบ่อวิน"]
  }
];
